<a href="https://colab.research.google.com/github/lakesidetech/machine_learning/blob/main/data_preprocessing_ML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Preprocessing in Python using Pandas and Scikit-learn
# There are 4 main important steps for the preprocessing of data.

*  Splitting of the data set in Training and Validation sets
*  Taking care of Missing values
*  Taking care of Categorical Features
*  Normalization of data set

In [ ]:
#1. Train Test Split

In [ ]:
#2. Taking Care of Missing Values

In [ ]:
#3. Taking care of Categorical Features

In [8]:
#4. Normalizing the Dataset
#The goal of normalization is to change values to a common scale without distorting the difference between the range of values.


import pandas as pd
from pandas import read_csv
cars_df=pd.read_csv('/content/cars.csv')

In [3]:
cars_df.head()

          Car       Model  Volume  Weight  CO2
0      Toyota        Aygo    1000     790   99
1  Mitsubishi  Space Star    1200    1160   95
2       Skoda      Citigo    1000     929   95
3        Fiat         500     900     865   90
4        Mini      Cooper    1500    1140  105

In [9]:
from sklearn.preprocessing import LabelEncoder

l1 = LabelEncoder()

l1.fit(cars_df['Model'])

cars_df.Model = l1.transform(cars_df.Model)
#catDf['Country'] = l1.transform(catDf['Country'])


print(cars_df)

           Car  Model  Volume  Weight  CO2
0       Toyota     10    1000     790   99
1   Mitsubishi     29    1200    1160   95
2        Skoda     14    1000     929   95
3         Fiat      4     900     865   90
4         Mini     16    1500    1140  105
5           VW     31    1000     929  105
6        Skoda     18    1400    1109   90
7     Mercedes      5    1500    1365   92
8         Ford     19    1500    1112   98
9         Audi      6    1600    1150   99
10     Hyundai     21    1100     980   99
11      Suzuki     30    1300     990  101
12        Ford     19    1000    1112   99
13       Honda     15    1600    1252   94
14      Hundai     22    1600    1326   97
15        Opel      9    1600    1330   97
16         BMW      0    1600    1365   99
17       Mazda      2    2200    1280  104
18       Skoda     26    1600    1119  104
19        Ford     20    2000    1328  105
20        Ford     24    1600    1584   94
21        Opel     23    2000    1428   99
22    Mercedes     12    2100    1365   99
23       Skoda     25    1600    1415   99
24       Volvo     27    2000    1415   99
25    Mercedes     13    1500    1465  102
26        Audi      7    2000    1490  104
27        Audi      8    2000    1725  114
28       Volvo     32    1600    1523  109
29         BMW      3    2000    1705  114
30    Mercedes     17    2100    1605  115
31       Volvo     33    2000    1746  117
32        Ford     11    1600    1235  104
33         BMW      1    1600    1390  108
34        Opel     34    1600    1405  109
35    Mercedes     28    2500    1395  120

In [10]:
cars_df.head()

          Car  Model  Volume  Weight  CO2
0      Toyota     10    1000     790   99
1  Mitsubishi     29    1200    1160   95
2       Skoda     14    1000     929   95
3        Fiat      4     900     865   90
4        Mini     16    1500    1140  105

In [11]:
l2 = LabelEncoder()

l2.fit(cars_df['Car'])

cars_df.Car = l2.transform(cars_df.Car)

In [12]:
cars_df.head()

   Car  Model  Volume  Weight  CO2
0   14     10    1000     790   99
1   10     29    1200    1160   95
2   12     14    1000     929   95
3    2      4     900     865   90
4    9     16    1500    1140  105

In [18]:
cars_df.shape

(36, 5)

In [19]:
#Extracting Independent and dependent Variable  
x= cars_df.iloc[:,0:4].values  
y= cars_df.iloc[:5].values  
print(x)
print(y)

[[  14   10 1000  790]
 [  10   29 1200 1160]
 [  12   14 1000  929]
 [   2    4  900  865]
 [   9   16 1500 1140]
 [  15   31 1000  929]
 [  12   18 1400 1109]
 [   8    5 1500 1365]
 [   3   19 1500 1112]
 [   0    6 1600 1150]
 [   6   21 1100  980]
 [  13   30 1300  990]
 [   3   19 1000 1112]
 [   4   15 1600 1252]
 [   5   22 1600 1326]
 [  11    9 1600 1330]
 [   1    0 1600 1365]
 [   7    2 2200 1280]
 [  12   26 1600 1119]
 [   3   20 2000 1328]
 [   3   24 1600 1584]
 [  11   23 2000 1428]
 [   8   12 2100 1365]
 [  12   25 1600 1415]
 [  16   27 2000 1415]
 [   8   13 1500 1465]
 [   0    7 2000 1490]
 [   0    8 2000 1725]
 [  16   32 1600 1523]
 [   1    3 2000 1705]
 [   8   17 2100 1605]
 [  16   33 2000 1746]
 [   3   11 1600 1235]
 [   1    1 1600 1390]
 [  11   34 1600 1405]
 [   8   28 2500 1395]]
[[  14   10 1000  790   99]
 [  10   29 1200 1160   95]
 [  12   14 1000  929   95]
 [   2    4  900  865   90]
 [   9   16 1500 1140  105]]